// /^(\+?7|8)?\s?\(?\d{3}\)?[\s-]?\d{3}[\s-]?\d{2}[\s-]?\d{2}$/

/*
- `/^` - початок рядка;
- `(\+?7|8)?` - необов'язковий код країни. Може бути записаний як з плюсом і цифрою "7", так і тільки цифрою "8";
- `\s?` - один необов'язковий пробіл після коду країни;
- `\(?` - можливий символ "(", який може раптово з'явитися після коду країни;
- `\d{3}\)?` - три цифри після можливого символа "(", за яким може слідувати закриваючий символ ")".
- `[\s-]?` - можливий пробіл чи дефіс після трьох цифр телефону. Цей символ може зустрітися один або ж жодного разу. Під цим символом може бути необов'язковий пробіл.
- `\d{3}[\s-]?\d{2}[\s-]?\d{2}` - перші три цифри після пробілу або дефісу, після яких можуть бути знову пробіл чи дефіс, ще дві цифри та дві останні цифри.
- `$` - кінець рядка.
*/

let phoneNumberRegex =
  /^(\+?7|8)?\s?\(?\d{3}\)?[\s-]?\d{3}[\s-]?\d{2}[\s-]?\d{2}$/;
let phoneNumber = "+7 (900) 123-45-67";
if (phoneNumberRegex.test(phoneNumber)) {
  console.log(`'${phoneNumber}' є номером телефону`);
} else {
  console.log(`'${phoneNumber}' не є номером телефону`);
}
